src/Documents/УчастиеВИвенте/УчастиеВИвенте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчастиеВИвенте</name>
  <registerRecords>InformationRegister.УчастиеВИвентах</registerRecords>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ивент</name>
    <type>
      <types>CatalogRef.Ивенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/УчастиеВИвентах/УчастиеВИвентах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастиеВИвентах</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Ивент</name>
    <type>
      <types>CatalogRef.Ивенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/СтатистикаПользователей/СтатистикаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтатистикаПользователей</name>
  <resources>
    <name>ВремяАренды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧислоМероприятий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Баланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧислоАренд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/УчастиеВИвенте/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр УчастиеВИвентах
	Движения.УчастиеВИвентах.Записывать = Истина;
	Движение = Движения.УчастиеВИвентах.Добавить();
	Движение.Ивент = Ивент;
	Движение.Клиент = Клиент;

	// регистр СтатистикаПользователей
	Движения.СтатистикаПользователей.Записывать = Истина;
	Движение = Движения.СтатистикаПользователей.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.ЧислоМероприятий = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, что дата участия в периоде ивента.
	Если (Дата > Ивент.ДатаЗакрытия Или Дата < Ивент.ДатаОткрытия) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Участие в ивенте не может произойти вне дат его проведения.",
			"Дата", ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
